import random

GREETING = 'Привет Мир, я Магический Шар, и я знаю ответ на любой твой вопрос.'
USER_NAME_PROMPT = 'Введите ваше имя:\n'

ANSWERS = ['Бесспорно', 'Предрешено', 'Никаких сомнений', 'Определённо да', 'Можешь быть уверен в этом',
           'Мне кажется - да', 'Вероятнее всего', 'Хорошие перспективы', 'Знаки говорят - да', 'Да',
           'Пока неясно, попробуй снова', 'Спроси позже', 'Лучше не рассказывать', 'Сейчас нельзя предсказать',
           'Сконцентрируйся и спроси опять', 'Даже не думай', 'Мой ответ - нет', 'По моим данным - нет',
           'Перспективы не очень хорошие', 'Весьма сомнительно']


def main():
    print(GREETING)

    user_name = input(USER_NAME_PROMPT)


main()
